const adjectives = [
    '귀여운', '앙칼진', '음흉한', '거대한', '어여쁜', '멋진', '강력한', '수줍은', '혼란한', '수다스런', '잠자는', '아름다운', '꿀빠는', '위험한', '난감한', '순진한', '순박한', '열정적인',
    '바쁜', '느린', '새빨간', '샛노란', '웅장한', '조그마한', '달콤한', '씁쓸한', '속상한', '새침한', '똑똑한', '현명한', '불쌍한', '가여운', '연약한', '재빠른', '점잖은', '은밀한',
    '따뜻한', '차가운', '착한', '아니꼬운', '토실토실', '귀여운', '말끔한', '댄디한', '풍족한', '흉폭한', '수수한', '산뜻한', '건강한', '가벼운', '이성적인', '감성적인', '거만한',
    '교활한', '구차한', '능청스런', '간사한', '충실한', '불량한', '자유분방한', '조급한', '억센', '톡톡쏘는', '사나운', '달달한', '스윗한', '과감한', '용감한', '용맹한', '서운한', '아기', 
];

const names = [
    '얼룩말', '물개', '북극여우', '사막여우', '코뿔소', '다람쥐', '올빼미', '잔나비', '원숭이', '고양이', '강아지', '해달', '수달', '천산갑', '모래두지', '캥거루', '북극곰', '코아티', '펭귄', '물범',
    '바다코끼리', '도마뱀', '판다', '물총새', '공작', '타마린', '화식조', '호랑이', '물소', '거북이', '황소', '문어', '고릴라', '쥐', '코알라', '쿼라', '코끼리', '갈매기', '염소', '패럿', '족제비', '고래',
    '돌고래', '가시두더지', '낙타', '오랑우탄', '래서판다', '알파카', '맨티', '표범', '상어', '사슴', '멧돼지', '돼지', '피카', '수달', '몽구스', '벌잡이새', '노루', '고라니', '친칠라', '햄스터', '티라노', 
    '스테고사우르스', '삼엽충', '암모나이트', '망나뇽', '우럭', '참돔', '잉어킹', '피카츄', '불곰', '곰돌이', '미어캣', '날치', '가오리', '박쥐', '참새', '황새', '제비', '까치', '너구리', '아나콘다', '피라냐',
];


const _getRandomName = () => {
    const adjective = adjectives[ Math.floor( Math.random() * ( adjectives.length -1 ))] ;
    const name = names[ Math.floor( Math.random() * (names.length -1) ) ];
    return `${adjective}${name}`
};

const getProject = async (pid) => {
    return {
        pid: pid,
        name: _getRandomName(),
        state: 1,
        companyName: 'Kakao',
    }
};

const getProjectList = async () => {
    return Promise.all(
        Array(100).fill(0).map(async (_, idx) => {
            const pid = Math.floor( Math.random() * 1000000)
            return await getProject(pid);
        })
    );
};


export { getProject, getProjectList };
